[
  {
    "name": "Tý",
    "id": "Rat",
    "data": [
        {
        "tieu_de": "Tử Vi Tuổi Tý Năm 2025 (Năm Ất Tỵ)",
        "tinh_cach": "Thông minh, nhanh nhẹn, lanh lợi, tháo vát, có khả năng thích nghi tốt. Họ thường có trực giác nhạy bén, khả năng phân tích và quan sát tốt. Người tuổi Tý cũng rất chăm chỉ, tiết kiệm và có ý chí phấn đấu cao. Tuy nhiên, đôi khi họ có thể hơi đa nghi, lo lắng thái quá và ít khi chia sẻ cảm xúc thật của mình.",
        
        "su_nghiep": {
            "nam": "Nam tuổi Tý trong năm 2025 có thể đối mặt với những thử thách trong công việc, đặc biệt là về cạnh tranh và áp lực từ cấp trên. Tuy nhiên, nếu kiên trì và giữ sự linh hoạt, họ có thể xoay chuyển tình thế, tìm ra hướng đi mới. Phù hợp với ngành tài chính, kỹ thuật, lập trình.",
            "nu": "Nữ tuổi Tý có thể gặp một số thay đổi trong công việc hoặc phải đảm nhận vai trò mới. Tuy gặp chút khó khăn ban đầu nhưng với sự chăm chỉ và cẩn thận, họ dễ gây ấn tượng tốt. Hợp với các nghề như marketing, giáo dục, y tế, nghệ thuật."
        },

        "tinh_duyen": {
            "nam": "Nam tuổi Tý có xu hướng ít chia sẻ cảm xúc, điều này có thể khiến đối phương cảm thấy xa cách. Năm nay cần học cách mở lòng và tạo dựng sự tin tưởng. Có cơ hội gắn bó lâu dài nếu biết lắng nghe và đồng hành.",
            "nu": "Nữ tuổi Tý trong năm 2025 có nhiều cơ hội về tình cảm, đặc biệt là từ người cũ quay lại hoặc người quen giới thiệu. Nên thận trọng, không vội vàng, tránh để cảm xúc nhất thời chi phối quyết định quan trọng."
        },

        "cong_viec_su_nghiep": [
            "Có thể gặp một số thách thức và áp lực. Công việc có thể không suôn sẻ như ý muốn, đòi hỏi sự kiên trì và linh hoạt để vượt qua.",
            "Cần cẩn trọng trong các mối quan hệ đồng nghiệp và đối tác, tránh vướng vào thị phi hoặc hiểu lầm không đáng có.",
            "Dù vậy, nếu bạn biết nắm bắt cơ hội và thay đổi, vẫn có thể tạo ra những bước đột phá."
        ],

        "tai_loc": [
            "Có thể có những khoản chi tiêu lớn cho gia đình hoặc các vấn đề cá nhân.",
            "Cần quản lý tài chính chặt chẽ, tránh đầu tư mạo hiểm hoặc cho vay mượn không rõ ràng.",
            "Khả năng thu nhập có thể ổn định nhưng không quá bùng nổ, cần tích lũy."
        ],

        "tinh_duyen_gia_dao": [
            "Có cơ hội gặp gỡ nhưng để tiến xa hơn cần sự kiên nhẫn và thấu hiểu lẫn nhau.",
            "Có thể gặp một vài hiểu lầm nhỏ, cần dành thời gian quan tâm và chia sẻ để giữ gìn hòa khí. Cẩn trọng với các mối quan hệ ngoài luồng có thể gây rắc rối."
        ],

        "suc_khoe": {
            "nam": [
            "Nam tuổi Tý cần chú ý các vấn đề về gan và huyết áp. Hạn chế bia rượu, thức khuya và căng thẳng kéo dài.",
            "Nên tăng cường vận động nhẹ nhàng, đặc biệt là vào buổi sáng để cải thiện tinh thần và thể chất."
            ],
            "nu": [
            "Nữ tuổi Tý nên lưu tâm đến nội tiết, da liễu và dạ dày. Căng thẳng dễ khiến cơ thể mệt mỏi và rối loạn giấc ngủ.",
            "Khuyến khích duy trì lịch sinh hoạt đều đặn, ăn uống thanh đạm, tập yoga hoặc thiền giúp cân bằng nội tâm."
            ]
        },

        "dieu_can_chu_y": {
            "nam": [
            "Tránh hành động vội vàng trong công việc hay đầu tư.",
            "Cẩn thận với các mối quan hệ xã hội dễ bị hiểu lầm.",
            "Đừng cố kiểm soát mọi việc một mình – biết chia sẻ, nhờ cậy đúng lúc."
            ],
            "nu": [
            "Đừng để cảm xúc cá nhân ảnh hưởng đến quyết định công việc.",
            "Hạn chế giao du với người mới quen quá nhanh – cần quan sát lâu dài.",
            "Biết cách từ chối những việc không phù hợp để giữ sự cân bằng cuộc sống."
            ]
        }
        }
    ]
    },
    {
        "name": "Sửu",
        "id": "Ox",
        "data": [
            {
            "tieu_de": "Tử Vi Tuổi Sửu Năm 2025 (Năm Ất Tỵ)",
            "tinh_cach": "Người tuổi Sửu nổi bật với tính cách cần cù, bền bỉ và đáng tin cậy. Họ không dễ bị dao động trước khó khăn, luôn giữ vững lập trường. Tuy nhiên, đôi lúc họ bảo thủ và thiếu linh hoạt khi xử lý tình huống mới.",

            "su_nghiep": {
                "nam": "Nam tuổi Sửu năm 2025 sẽ có bước tiến trong công việc nếu biết mở rộng quan hệ và học cách thích nghi. Cẩn trọng trong việc ký kết hoặc mở rộng kinh doanh. Thích hợp các ngành kỹ thuật, xây dựng, tài chính, quản lý.",
                "nu": "Nữ tuổi Sửu có thể nhận được sự công nhận từ cấp trên nhờ thái độ chăm chỉ, tận tụy. Tuy nhiên, cần tránh áp lực dẫn đến kiệt sức. Phù hợp với các ngành như giáo dục, y tế, nghệ thuật, tài chính cá nhân."
            },

            "tinh_duyen": {
                "nam": "Nam tuổi Sửu thường kiệm lời và khó bày tỏ cảm xúc, dễ khiến đối phương hiểu lầm. Năm nay nên học cách chủ động trong mối quan hệ. Có khả năng gặp được người phù hợp nếu mở lòng.",
                "nu": "Nữ tuổi Sửu có sức hút riêng nhờ sự chững chạc, ổn định. Đối với người độc thân, có thể phát triển mối quan hệ lâu dài từ bạn bè thân thiết. Người đã có đôi cần cẩn trọng với sự im lặng kéo dài, dễ tạo khoảng cách."
            },

            "cong_viec_su_nghiep": [
                "Năm 2025 là thời điểm thuận lợi để người tuổi Sửu mở rộng các mối quan hệ hợp tác, đặc biệt là những ai đang làm trong lĩnh vực tài chính, bất động sản, công nghệ hoặc giáo dục.",
                "Sẽ có một số thử thách trong quý II và quý III, yêu cầu tuổi Sửu phải nhanh nhạy thích nghi với thay đổi. Tuy nhiên, nếu giữ vững lập trường và biết tiếp thu ý kiến từ đồng nghiệp, họ sẽ vượt qua dễ dàng.",
                "Người tuổi Sửu làm kinh doanh nên thận trọng khi ký kết hợp đồng mới hoặc đầu tư quy mô lớn. Hãy tham khảo ý kiến chuyên gia hoặc người có kinh nghiệm trước khi đưa ra quyết định."
            ],

            "tai_loc": [
                "Tình hình tài chính nhìn chung ổn định, thậm chí có dấu hiệu khởi sắc vào nửa cuối năm nhờ các khoản thu phụ, lợi nhuận từ dự án cũ.",
                "Tuổi Sửu nên dành một phần thu nhập để đầu tư học hỏi, nâng cao kỹ năng, điều này sẽ giúp họ kiếm được nhiều hơn trong tương lai.",
                "Tránh tham gia vào các hoạt động tài chính không rõ ràng hoặc có tính may rủi cao, đặc biệt trong tháng 5 và tháng 8 âm lịch."
            ],

            "tinh_duyen_gia_dao": [
                "Với người độc thân, năm 2025 mang đến nhiều cơ hội gặp gỡ, đặc biệt thông qua các hoạt động cộng đồng, đi du lịch hoặc kết nối công việc.",
                "Người đã có đôi nên dành thời gian để hâm nóng tình cảm, tránh để công việc bận rộn làm rạn nứt mối quan hệ. Một chuyến đi ngắn ngày sẽ rất có ích.",
                "Trong gia đình, cần lắng nghe và chia sẻ nhiều hơn, đặc biệt với người lớn tuổi. Giữ hòa khí là điều then chốt trong năm nay."
            ],

            "suc_khoe": {
                "nam": [
                "Nam tuổi Sửu dễ bị ảnh hưởng bởi căng thẳng công việc, dẫn đến đau đầu hoặc các vấn đề về tiêu hóa.",
                "Nên dành thời gian nghỉ ngơi, tập gym nhẹ hoặc thể thao ngoài trời để giải tỏa áp lực."
                ],
                "nu": [
                "Nữ tuổi Sửu nên cẩn trọng với các bệnh về nội tiết và dạ dày. Dễ bị rối loạn giấc ngủ hoặc mệt mỏi kéo dài nếu làm việc quá sức.",
                "Khuyến khích duy trì chế độ ăn thanh đạm, nhiều rau củ và hạn chế thức ăn nhanh. Tập yoga hoặc thiền sẽ rất phù hợp."
                ]
            },

            "dieu_can_chu_y": {
                "nam": [
                "Tránh quá cứng nhắc trong các mối quan hệ đối tác, hãy học cách mềm mỏng và lắng nghe.",
                "Không nên chi tiêu bốc đồng hoặc đầu tư theo cảm tính.",
                "Cần chú ý đến sức khỏe tâm lý, không nên ôm đồm quá nhiều việc cùng lúc."
                ],
                "nu": [
                "Cẩn thận khi chia sẻ chuyện riêng tư trong môi trường làm việc – dễ bị lợi dụng hoặc hiểu nhầm.",
                "Nên cân bằng thời gian giữa công việc và gia đình, đừng hy sinh bản thân quá mức.",
                "Chú ý cảm xúc cá nhân, hạn chế đưa ra quyết định quan trọng khi đang mất bình tĩnh."
                ]
            }
            }
        ]
    },
    {
        "name": "Dần",
        "id": "Tiger",
        "data": [
            {
            "tieu_de": "Tử Vi Tuổi Dần Năm 2025 (Năm Ất Tỵ)",

            "tinh_cach": "Người tuổi Dần thường mạnh mẽ, cá tính, dũng cảm và có chí tiến thủ cao. Họ năng động, quyết đoán, có tố chất lãnh đạo và không ngại thử thách. Tuy nhiên, họ cũng dễ nóng nảy, đôi khi thiếu kiên nhẫn và hơi bảo thủ.",

            "su_nghiep": {
                "nam": "Nam tuổi Dần năm nay sẽ có cơ hội bước vào giai đoạn phát triển mới trong sự nghiệp nếu biết nắm bắt thời cơ và kiềm chế cá tính mạnh. Cần tránh va chạm với cấp trên, đồng nghiệp. Hợp với các công việc liên quan đến quản lý, điều hành, đầu tư.",
                "nu": "Nữ tuổi Dần có khả năng gặt hái thành công nhờ tinh thần độc lập và sự sáng tạo. Tuy nhiên, nên học cách lắng nghe và phối hợp để giảm áp lực. Có thể mở rộng lĩnh vực mới như nghệ thuật, nội dung số, marketing hoặc giáo dục."
            },

            "tinh_duyen": {
                "nam": "Nam tuổi Dần khá mạnh mẽ và chủ động trong chuyện tình cảm, nhưng đôi khi dễ khiến đối phương cảm thấy bị áp đặt. Cần học cách chia sẻ và thấu hiểu nhiều hơn. Nếu đang yêu, có thể tính chuyện lâu dài.",
                "nu": "Nữ tuổi Dần cuốn hút bởi sự tự tin và cá tính, nhưng dễ cảm thấy cô đơn nếu đối phương không đủ tinh tế. Cần giảm bớt kiểm soát và mềm mỏng hơn để duy trì mối quan hệ hòa hợp."
            },

            "cong_viec_su_nghiep": [
                "Năm 2025 là năm có nhiều chuyển biến trong sự nghiệp của tuổi Dần.",
                "Có thể sẽ có cơ hội thăng tiến hoặc thay đổi công việc mang lại môi trường mới tích cực hơn.",
                "Cần giữ thái độ bình tĩnh, tránh xung đột trong công việc, đặc biệt là với cấp trên hoặc đồng nghiệp."
            ],

            "tai_loc": [
                "Tài lộc năm nay ở mức trung bình, cần tránh đầu tư liều lĩnh hoặc quá tham vọng.",
                "Có thể phát sinh các khoản chi tiêu bất ngờ, nên chuẩn bị sẵn quỹ dự phòng.",
                "Việc kinh doanh nếu có thì nên bắt đầu nhỏ và chắc chắn."
            ],

            "tinh_duyen_gia_dao": [
                "Người độc thân có cơ hội gặp gỡ người phù hợp nhưng cần thời gian để tìm hiểu kỹ.",
                "Gia đạo dễ xảy ra mâu thuẫn nếu không biết nhẫn nhịn và cảm thông.",
                "Hãy dành thời gian nhiều hơn cho người thân, tránh xa sự lạnh nhạt."
            ],

            "suc_khoe": {
                "nam": [
                "Nam tuổi Dần cần chú ý đến gan và huyết áp, nhất là khi làm việc căng thẳng kéo dài.",
                "Nên tránh rượu bia, thức khuya và duy trì luyện tập thể thao đều đặn."
                ],
                "nu": [
                "Nữ tuổi Dần dễ gặp vấn đề liên quan đến tim mạch nhẹ hoặc nội tiết. Cần giữ tinh thần thư thái.",
                "Chế độ ăn uống lành mạnh và giấc ngủ điều độ sẽ giúp ổn định sức khỏe và nhan sắc."
                ]
            },

            "dieu_can_chu_y": {
                "nam": [
                "Hạn chế thể hiện cảm xúc tiêu cực trong công việc, dễ gây mâu thuẫn hoặc mất cơ hội.",
                "Cẩn trọng khi đi xa hoặc tham gia dự án tài chính mới – nên có cố vấn đáng tin cậy.",
                "Giữ cân bằng giữa cái tôi và sự hợp tác để đạt hiệu quả cao hơn."
                ],
                "nu": [
                "Không nên ôm đồm quá nhiều việc cùng lúc, dễ dẫn đến mệt mỏi và stress.",
                "Tránh tiêu xài cảm tính hoặc mua sắm để giải tỏa cảm xúc.",
                "Cẩn thận với các mối quan hệ xã hội mới – nên chọn lọc người tâm giao."
                ]
            }
            }
        ]
    },
    {
        "name": "Mão",
        "id": "Cat",
        "data": [
            {
            "tieu_de": "Tử Vi Tuổi Mão Năm 2025 (Năm Ất Tỵ)",

            "tinh_cach": "Người tuổi Mão thường hiền lành, nhẹ nhàng, tinh tế và có khả năng giao tiếp tốt. Họ sống tình cảm, biết quan tâm người khác, có trực giác mạnh và đầu óc sáng tạo. Tuy nhiên, đôi khi họ cũng dễ bị cảm xúc chi phối, thiếu quyết đoán trong những thời điểm quan trọng.",

            "su_nghiep": {
                "nam": "Nam tuổi Mão có xu hướng tìm kiếm sự ổn định và cân bằng trong công việc. Họ không thích bon chen nhưng làm việc rất chăm chỉ và kỹ lưỡng. Trong năm 2025, cần cẩn trọng với những thay đổi đột ngột về môi trường làm việc.",
                "nu": "Nữ tuổi Mão phát huy tốt khả năng sáng tạo và giao tiếp trong môi trường có tính mềm dẻo như giáo dục, nghệ thuật, nhân sự. Năm nay có thể là thời điểm thuận lợi để thể hiện năng lực cá nhân nếu đủ tự tin và chủ động."
            },

            "tinh_duyen": {
                "nam": "Nam tuổi Mão là người nhẹ nhàng, chân thành và quan tâm. Tuy nhiên, đôi khi họ bị động, không dám chủ động trong chuyện tình cảm. Nếu đang trong mối quan hệ, hãy mạnh dạn chia sẻ nhiều hơn.",
                "nu": "Nữ tuổi Mão rất tinh tế và chu đáo, nhưng cũng dễ tổn thương nếu không được đối phương quan tâm đúng mức. Năm 2025 là thời điểm thuận lợi để mở lòng và kết nối bền vững hơn."
            },

            "cong_viec_su_nghiep": [
                "Năm 2025 là thời điểm cần kiên trì và cẩn trọng trong công việc.",
                "Dễ có sự thay đổi bất ngờ hoặc chuyển hướng trong nghề nghiệp, nên chuẩn bị tâm lý đón nhận.",
                "Quan hệ đồng nghiệp tương đối hài hòa, nếu biết tận dụng sẽ giúp ích cho sự phát triển lâu dài."
            ],

            "tai_loc": [
                "Tài chính năm nay không quá dư dả, cần quản lý chi tiêu chặt chẽ hơn.",
                "Tránh đầu tư mạo hiểm hoặc tin tưởng vào các dự án chưa rõ ràng.",
                "Có cơ hội gia tăng thu nhập nhờ công việc tay trái hoặc kinh doanh nhỏ lẻ."
            ],

            "tinh_duyen_gia_dao": [
                "Tình cảm tiến triển tốt nếu cả hai cùng chia sẻ và thấu hiểu.",
                "Gia đạo nhìn chung yên ấm, nhưng cần tránh để những chuyện nhỏ gây tranh cãi.",
                "Người độc thân dễ có cơ hội gặp gỡ người phù hợp qua bạn bè, mạng xã hội hoặc công việc."
            ],

            "suc_khoe": {
                "nam": [
                "Nam tuổi Mão cần chú ý đến các bệnh liên quan đến mắt và xương khớp do thói quen ngồi lâu, ít vận động.",
                "Nên duy trì thể dục nhẹ và giảm bớt thời gian sử dụng thiết bị điện tử ban đêm."
                ],
                "nu": [
                "Nữ tuổi Mão dễ gặp các vấn đề về nội tiết, giấc ngủ và tâm lý nếu làm việc quá căng thẳng.",
                "Chế độ ăn nhiều rau xanh, nghỉ ngơi đúng giờ và vận động nhẹ nhàng sẽ giúp cải thiện rõ rệt sức khỏe."
                ]
            },

            "dieu_can_chu_y": {
                "nam": [
                "Hạn chế trì hoãn khi có cơ hội tốt – hãy dứt khoát và tự tin hơn.",
                "Tránh quá phụ thuộc vào cảm xúc, nên đặt mục tiêu rõ ràng trong công việc.",
                "Khi cảm thấy áp lực, hãy tìm đến các hoạt động nhẹ như đi bộ, thiền để giải tỏa."
                ],
                "nu": [
                "Đừng vì cả nể mà ôm đồm nhiều việc – nên học cách từ chối hợp lý.",
                "Tránh bị cảm xúc chi phối khi ra quyết định tài chính hoặc công việc.",
                "Tìm người đáng tin để chia sẻ, thay vì giữ mọi thứ trong lòng gây mệt mỏi tinh thần."
                ]
            }
            }
        ]
    },
    {
        "name": "Thìn",
        "id": "Dragon",
        "data": [
            {
            "tieu_de": "Tử Vi Tuổi Thìn Năm 2025 (Năm Ất Tỵ)",

            "tinh_cach": "Người tuổi Thìn thường mạnh mẽ, tự tin, có tầm nhìn xa và khả năng lãnh đạo bẩm sinh. Họ luôn tràn đầy năng lượng, tham vọng và sẵn sàng đối mặt với thử thách. Tuy nhiên, đôi lúc họ có thể nóng nảy, bảo thủ và không dễ tiếp thu ý kiến người khác.",

            "su_nghiep": {
                "nam": "Nam tuổi Thìn thể hiện rõ bản lĩnh lãnh đạo và ý chí vươn lên trong năm 2025. Tuy nhiên, cần kiểm soát cái tôi và biết phối hợp với người khác để tiến xa hơn. Đây là năm có thể thăng tiến nếu giữ vững kỷ luật và tính tổ chức.",
                "nu": "Nữ tuổi Thìn có cơ hội phát huy tính sáng tạo và sự linh hoạt trong công việc. Năm 2025 mang đến nhiều thay đổi tích cực nếu biết chủ động học hỏi và thích nghi. Tuy nhiên, cần tránh cảm xúc chi phối các quyết định quan trọng."
            },

            "tinh_duyen": {
                "nam": "Nam tuổi Thìn yêu mãnh liệt và nhiều hoài bão, đôi khi quá kỳ vọng vào đối phương. Họ cần học cách lắng nghe và chia sẻ nhiều hơn để giữ sự hòa hợp trong tình cảm.",
                "nu": "Nữ tuổi Thìn luôn hết mình vì tình yêu nhưng cũng khá nhạy cảm. Năm nay, hãy dành thời gian hiểu rõ cảm xúc cá nhân trước khi bước vào mối quan hệ sâu sắc."
            },

            "cong_viec_su_nghiep": [
                "Năm 2025 là giai đoạn phát triển thuận lợi nếu biết kiểm soát cảm xúc và làm việc có kế hoạch.",
                "Có cơ hội thăng tiến hoặc mở rộng quy mô công việc, nhất là với người làm kinh doanh, quản lý.",
                "Cần lưu ý đến sự hợp tác, tránh làm việc đơn độc hoặc quá chủ quan trong quyết định quan trọng."
            ],

            "tai_loc": [
                "Tài chính nhìn chung khá khởi sắc, có thể có nguồn thu từ nhiều phía.",
                "Cần tỉnh táo khi đầu tư hoặc ký kết hợp đồng tài chính.",
                "Tránh chi tiêu bốc đồng hoặc để cảm xúc chi phối trong các quyết định tiền bạc."
            ],

            "tinh_duyen_gia_dao": [
                "Tình cảm tiến triển tốt nếu học cách chia sẻ và kiềm chế cái tôi.",
                "Người có gia đình nên dành thêm thời gian cho bạn đời để giữ sự gắn kết.",
                "Người độc thân dễ gặp được nhân duyên thông qua công việc hoặc bạn bè giới thiệu."
            ],

            "suc_khoe": {
                "nam": [
                "Nam tuổi Thìn cần đặc biệt chú ý đến gan và huyết áp, tránh dùng chất kích thích hoặc làm việc quá sức.",
                "Tâm lý căng thẳng kéo dài có thể dẫn đến mất ngủ và suy giảm sức khỏe – nên tập thể dục đều đặn và ngủ đúng giờ."
                ],
                "nu": [
                "Nữ tuổi Thìn nên quan tâm đến sức khỏe tim mạch và hệ thần kinh, đặc biệt trong thời kỳ stress công việc hoặc gia đình.",
                "Chế độ dinh dưỡng đầy đủ, yoga hoặc thiền định sẽ giúp cải thiện tinh thần hiệu quả."
                ]
            },

            "dieu_can_chu_y": {
                "nam": [
                "Tránh đưa ra quyết định nóng vội khi tức giận hoặc trong lúc chưa rõ thông tin.",
                "Học cách lắng nghe góp ý để cải thiện bản thân.",
                "Không nên ôm đồm việc hoặc can thiệp quá sâu vào chuyện người khác, dễ gây mâu thuẫn."
                ],
                "nu": [
                "Nữ tuổi Thìn nên cẩn trọng khi ký kết hợp đồng hoặc đầu tư tài chính – tránh tin tưởng quá nhanh.",
                "Tập trung cải thiện kỹ năng giao tiếp và kiểm soát cảm xúc để tránh xung đột không đáng có.",
                "Đừng quá khắt khe với bản thân – hãy dành thời gian nghỉ ngơi, thư giãn hợp lý."
                ]
            }
            }
        ]
    },
    {
        "name": "Tỵ",
        "id": "Snake",
        "data": [
            {
            "tieu_de": "Tử Vi Tuổi Tỵ Năm 2025 (Năm Ất Tỵ)",

            "tinh_cach": "Người tuổi Tỵ thường thông minh, sắc sảo, khéo léo và có nội tâm sâu sắc. Họ sống kín đáo, ít khi thể hiện suy nghĩ thật ra bên ngoài nhưng lại có trực giác rất tốt và quyết đoán. Tuy nhiên, đôi lúc họ có thể trở nên bảo thủ, ít chia sẻ và dễ cảm thấy cô đơn.",

            "su_nghiep": {
                "nam": "Nam tuổi Tỵ năm 2025 có cơ hội phát triển vượt bậc nếu biết tận dụng thế mạnh phân tích và tư duy chiến lược. Tuy nhiên, cần mở lòng hơn trong giao tiếp và hợp tác với đồng đội để tiến xa hơn.",
                "nu": "Nữ tuổi Tỵ có xu hướng làm việc độc lập hiệu quả trong năm nay. Họ nên chủ động bày tỏ quan điểm, tránh giữ kín mọi thứ trong lòng. Nếu linh hoạt hơn trong môi trường nhóm, sẽ đạt thành công rõ rệt."
            },

            "tinh_duyen": {
                "nam": "Nam tuổi Tỵ yêu sâu sắc nhưng đôi lúc có xu hướng kiểm soát quá mức. Năm 2025, hãy học cách tin tưởng và chia sẻ nhiều hơn với người yêu để xây dựng mối quan hệ bền vững.",
                "nu": "Nữ tuổi Tỵ giàu cảm xúc và chung thủy. Năm nay dễ gặp được người đồng điệu về tâm hồn nếu sẵn sàng mở lòng và kiên nhẫn với bản thân. Tránh kỳ vọng quá cao dễ dẫn đến thất vọng."
            },

            "cong_viec_su_nghiep": [
                "Năm 2025 là thời điểm để người tuổi Tỵ phát huy năng lực cá nhân, đặc biệt trong các lĩnh vực chuyên môn.",
                "Có thể gặp áp lực từ môi trường làm việc hoặc cấp trên, nhưng nếu kiên trì sẽ gặt hái được kết quả tốt.",
                "Quan trọng là giữ thái độ cầu thị và linh hoạt trước thay đổi trong công việc."
            ],

            "tai_loc": [
                "Tài chính ổn định nhưng không nên đầu tư mạo hiểm trong năm nay.",
                "Cẩn trọng khi hợp tác kinh doanh hoặc vay mượn tiền bạc, tránh bị lợi dụng.",
                "Nếu biết tiết kiệm và quản lý tài chính khéo léo, vẫn có thể tích lũy khá tốt."
            ],

            "tinh_duyen_gia_dao": [
                "Người độc thân dễ có nhân duyên mới thông qua các mối quan hệ xã hội.",
                "Gia đạo khá ổn định nếu biết dung hòa cảm xúc và lắng nghe nhau.",
                "Tránh để công việc ảnh hưởng quá nhiều đến thời gian dành cho người thân."
            ],

            "suc_khoe": {
                "nam": [
                "Nam tuổi Tỵ dễ gặp tình trạng căng thẳng tâm lý, stress do áp lực công việc.",
                "Cần xây dựng thời gian biểu nghỉ ngơi hợp lý và tránh làm việc thâu đêm."
                ],
                "nu": [
                "Nữ tuổi Tỵ có thể gặp vấn đề mất ngủ hoặc rối loạn cảm xúc nhẹ nếu suy nghĩ quá nhiều.",
                "Thiền, yoga hoặc trò chuyện với người thân sẽ giúp cải thiện tinh thần hiệu quả."
                ]
            },

            "dieu_can_chu_y": {
                "nam": [
                "Không nên ôm đồm quá nhiều việc hoặc cố gắng tự giải quyết mọi thứ một mình.",
                "Tránh tranh cãi trong môi trường công sở, dễ dẫn đến mâu thuẫn không đáng có.",
                "Hãy học cách lắng nghe nhiều hơn và chia sẻ đúng lúc để tránh hiểu lầm."
                ],
                "nu": [
                "Nên chủ động kiểm tra lại các giấy tờ quan trọng trước khi ký kết.",
                "Tránh đưa ra quyết định tài chính chỉ dựa vào cảm xúc nhất thời.",
                "Tập trung vào phát triển kỹ năng mềm và giữ sự bình tĩnh trong các tình huống áp lực."
                ]
            }
            }
        ]
    },
    {
        "name": "Ngọ",
        "id": "Horse",
        "data": [
            {
            "tieu_de": "Tử Vi Tuổi Ngọ Năm 2025 (Năm Ất Tỵ)",

            "tinh_cach": "Người tuổi Ngọ thường năng động, nhiệt huyết, yêu thích tự do và độc lập. Họ có tinh thần lạc quan, dễ thích nghi và thường mang đến năng lượng tích cực cho những người xung quanh. Tuy nhiên, đôi khi họ thiếu kiên nhẫn và dễ nản lòng khi gặp khó khăn.",

            "su_nghiep": {
                "nam": "Nam tuổi Ngọ năm 2025 có nhiều ý tưởng sáng tạo và khả năng nắm bắt cơ hội nhanh. Tuy nhiên, cần kiên trì và tránh thay đổi quá nhanh để không bỏ lỡ thành quả lâu dài.",
                "nu": "Nữ tuổi Ngọ năm nay thuận lợi nếu biết tận dụng khả năng giao tiếp và làm việc nhóm. Nên tập trung vào các dự án cụ thể thay vì ôm đồm quá nhiều hướng đi cùng lúc."
            },

            "tinh_duyen": {
                "nam": "Nam tuổi Ngọ có sức hút tự nhiên, dễ thu hút người khác giới. Tuy nhiên, để tình cảm phát triển bền lâu, cần hạn chế sự bốc đồng và học cách ổn định cảm xúc.",
                "nu": "Nữ tuổi Ngọ năm nay dễ rung động nhưng cũng dễ thất vọng. Cần xác định rõ điều mình cần trong một mối quan hệ và tránh lý tưởng hóa quá mức."
            },

            "cong_viec_su_nghiep": [
                "Năm 2025 có thể mang đến những cơ hội mới cho tuổi Ngọ, đặc biệt trong lĩnh vực sáng tạo hoặc kinh doanh cá nhân.",
                "Tuy nhiên, cần cẩn trọng với những thay đổi bất ngờ và tránh hành động vội vàng.",
                "Mối quan hệ với đồng nghiệp hoặc cấp trên có thể gặp khúc mắc, nên giữ thái độ ôn hòa, cầu thị."
            ],

            "tai_loc": [
                "Tài chính không quá dồi dào nhưng ổn định nếu biết cân nhắc chi tiêu.",
                "Hạn chế đầu tư lớn trong năm nay, nhất là các lĩnh vực không quen thuộc.",
                "Có thể có nguồn thu phụ từ công việc làm thêm hoặc kinh doanh nhỏ."
            ],

            "tinh_duyen_gia_dao": [
                "Người độc thân có cơ hội gặp gỡ người phù hợp, nhưng cần xây dựng mối quan hệ trên nền tảng tin tưởng.",
                "Người đã có gia đình cần dành nhiều thời gian hơn để hâm nóng tình cảm.",
                "Tránh tranh cãi vì những chuyện nhỏ nhặt trong cuộc sống thường ngày."
            ],

            "suc_khoe": {
                "nam": [
                "Nam tuổi Ngọ nên chú ý đến huyết áp và tim mạch, đặc biệt là khi làm việc căng thẳng.",
                "Tập thể dục thể thao thường xuyên sẽ giúp cải thiện tinh thần và sức khỏe tổng thể."
                ],
                "nu": [
                "Nữ tuổi Ngọ cần chú ý đến chế độ ăn uống và giấc ngủ.",
                "Tránh lạm dụng đồ uống kích thích và nên ưu tiên vận động nhẹ như yoga, đi bộ."
                ]
            },

            "dieu_can_chu_y": {
                "nam": [
                "Tránh hành động theo cảm tính, đặc biệt là khi đầu tư hoặc thay đổi công việc.",
                "Cẩn trọng trong các mối quan hệ công sở, tránh xung đột không đáng có.",
                "Học cách xây dựng kế hoạch rõ ràng thay vì tùy hứng."
                ],
                "nu": [
                "Cần giữ tinh thần lạc quan, tránh để cảm xúc tiêu cực kéo dài.",
                "Hạn chế chia sẻ thông tin cá nhân hoặc tài chính cho người chưa đủ tin cậy.",
                "Duy trì lối sống khoa học, đặc biệt là tránh thức khuya nhiều đêm liên tiếp."
                ]
            }
            }
        ]
    },
    {
        "name": "Mùi",
        "id": "Goat",
        "data": [
            {
            "tieu_de": "Tử Vi Tuổi Mùi Năm 2025 (Năm Ất Tỵ)",

            "tinh_cach": "Người tuổi Mùi thường hiền lành, nhân hậu, sống nội tâm và sâu sắc. Họ có lòng trắc ẩn, luôn sẵn lòng giúp đỡ người khác. Tuổi Mùi sống khá tình cảm, đôi khi có phần nhút nhát và thiếu quyết đoán trong các tình huống quan trọng.",

            "su_nghiep": {
                "nam": "Nam tuổi Mùi trong năm 2025 có nhiều cơ hội chuyển biến tích cực nếu biết mở rộng mối quan hệ xã hội. Nên dũng cảm thử thách bản thân trong lĩnh vực mới để khẳng định năng lực.",
                "nu": "Nữ tuổi Mùi sẽ thuận lợi hơn nếu làm việc trong môi trường ổn định và có sự hỗ trợ từ đồng nghiệp. Khéo léo trong giao tiếp sẽ giúp họ tránh thị phi và đạt được sự tín nhiệm."
            },

            "tinh_duyen": {
                "nam": "Nam tuổi Mùi cần chủ động hơn trong tình cảm, tránh thụ động khiến mối quan hệ trở nên xa cách. Hãy thể hiện sự quan tâm qua hành động cụ thể thay vì giữ kín cảm xúc.",
                "nu": "Nữ tuổi Mùi dễ rung động nhưng cũng nhạy cảm và hay suy nghĩ nhiều. Cần tìm được người biết lắng nghe, chia sẻ để cảm thấy an toàn và yên tâm trong tình yêu."
            },

            "cong_viec_su_nghiep": [
                "Năm 2025 mang đến nhiều cơ hội mới, nhưng tuổi Mùi cần mạnh dạn nắm bắt thay vì chờ đợi.",
                "Các mối quan hệ xã hội sẽ đóng vai trò quan trọng trong việc phát triển sự nghiệp.",
                "Đề phòng tiểu nhân hoặc thị phi nơi công sở, nên giữ thái độ điềm tĩnh, hòa nhã."
            ],

            "tai_loc": [
                "Tài lộc trong năm khá ổn định, không quá dồi dào nhưng cũng không gặp thiếu hụt lớn.",
                "Có thể nhận được một khoản bất ngờ từ người thân hoặc công việc ngoài dự kiến.",
                "Tránh chi tiêu theo cảm xúc, nên có kế hoạch tài chính rõ ràng để tích lũy lâu dài."
            ],

            "tinh_duyen_gia_dao": [
                "Người độc thân có cơ hội kết nối qua bạn bè hoặc các hoạt động xã hội.",
                "Người đã kết hôn nên dành nhiều thời gian hơn để vun đắp tình cảm gia đình.",
                "Cần thẳng thắn và chân thành trong giao tiếp để tránh hiểu lầm không đáng có."
            ],

            "suc_khoe": {
                "nam": [
                "Nam tuổi Mùi nên chú ý đến hệ tiêu hóa, đặc biệt khi ăn uống thất thường.",
                "Nên vận động nhẹ nhàng như đi bộ, thể dục buổi sáng giúp giảm stress."
                ],
                "nu": [
                "Nữ tuổi Mùi cần chăm sóc giấc ngủ và tránh thức khuya.",
                "Có thể gặp các vấn đề về dạ dày nếu căng thẳng kéo dài – hãy duy trì tinh thần tích cực."
                ]
            },

            "dieu_can_chu_y": {
                "nam": [
                "Không nên bỏ lỡ cơ hội chỉ vì thiếu tự tin.",
                "Cần rèn luyện sự kiên định trong công việc và cảm xúc.",
                "Hạn chế chia sẻ quá nhiều thông tin cá nhân nơi công sở."
                ],
                "nu": [
                "Tránh ôm đồm quá nhiều việc cùng lúc khiến bản thân mệt mỏi.",
                "Học cách thể hiện chính kiến một cách khéo léo và rõ ràng.",
                "Tập trung xây dựng thói quen sống kỷ luật để cân bằng tâm lý."
                ]
            }
            }
        ]
    },
    {
        "name": "Thân",
        "id": "Monkey",
        "data": [
            {
            "tieu_de": "Tử Vi Tuổi Thân Năm 2025 (Năm Ất Tỵ)",

            "tinh_cach": "Người tuổi Thân thông minh, nhanh nhẹn và hoạt bát. Họ có óc sáng tạo, giỏi ứng biến và thích nghi nhanh với môi trường. Tuy nhiên, đôi khi họ thiếu kiên nhẫn, dễ chán nản nếu công việc không đúng sở thích.",

            "su_nghiep": {
                "nam": "Nam tuổi Thân năm 2025 dễ có đột phá trong công việc nếu dám nghĩ dám làm. Tuy nhiên, cần tránh chủ quan và biết kiên định với định hướng dài hạn.",
                "nu": "Nữ tuổi Thân có nhiều cơ hội học hỏi và phát triển trong môi trường mới. Nếu biết tận dụng mối quan hệ đồng nghiệp, họ có thể gặt hái nhiều thành công bất ngờ."
            },

            "tinh_duyen": {
                "nam": "Nam tuổi Thân khá thu hút nhưng dễ thay đổi cảm xúc. Nếu muốn xây dựng mối quan hệ bền vững, cần học cách kiềm chế cái tôi và kiên định trong tình cảm.",
                "nu": "Nữ tuổi Thân có sức hút riêng và dễ tạo thiện cảm. Tuy nhiên, cần rõ ràng trong cảm xúc, tránh dẫn đến hiểu lầm hoặc thiếu ổn định trong mối quan hệ."
            },

            "cong_viec_su_nghiep": [
                "Năm 2025 mở ra nhiều cơ hội mới, đặc biệt trong các lĩnh vực sáng tạo và công nghệ.",
                "Cần chủ động và kiên định với mục tiêu, tránh nhảy việc hoặc thay đổi kế hoạch liên tục.",
                "Hợp tác với đồng nghiệp sẽ mang lại kết quả tích cực, nên tránh làm việc một mình."
            ],

            "tai_loc": [
                "Tài chính ổn định, có khả năng tăng thu nhập qua dự án phụ hoặc đầu tư nhỏ.",
                "Không nên mạo hiểm tài chính trong các lĩnh vực chưa có kinh nghiệm.",
                "Chi tiêu hợp lý, tránh sa vào mua sắm không cần thiết."
            ],

            "tinh_duyen_gia_dao": [
                "Người độc thân có cơ hội gặp gỡ đối tượng phù hợp qua môi trường công việc.",
                "Gia đình êm ấm nếu biết nhường nhịn và quan tâm lẫn nhau.",
                "Cần tránh thói quen cứng đầu, nên lắng nghe đối phương nhiều hơn."
            ],

            "suc_khoe": {
                "nam": [
                "Nam tuổi Thân dễ bị căng thẳng do áp lực công việc, cần nghỉ ngơi hợp lý.",
                "Cẩn trọng với gan, tiêu hóa và mất ngủ do thức khuya hoặc dùng chất kích thích."
                ],
                "nu": [
                "Nữ tuổi Thân nên chú ý đến nội tiết, dễ mệt mỏi nếu ăn uống thất thường.",
                "Giữ thói quen thể dục đều đặn sẽ giúp cải thiện tinh thần và sức đề kháng."
                ]
            },

            "dieu_can_chu_y": {
                "nam": [
                "Hạn chế đưa ra quyết định vội vàng trong công việc và tài chính.",
                "Tránh mâu thuẫn với đồng nghiệp hoặc đối tác vì cái tôi cá nhân.",
                "Giữ thói quen sinh hoạt điều độ, tránh làm việc quá sức."
                ],
                "nu": [
                "Đừng để cảm xúc ảnh hưởng đến hiệu suất công việc.",
                "Chú ý giữ hình ảnh cá nhân nơi công sở để tránh thị phi.",
                "Biết nói “không” với những mối quan hệ không rõ ràng hoặc lợi dụng."
                ]
            }
            }
        ]
    },
    {
        "name": "Dậu",
        "id": "Rooster",
        "data": [
            {
            "tieu_de": "Tử Vi Tuổi Dậu Năm 2025 (Năm Ất Tỵ)",

            "tinh_cach": "Người tuổi Dậu thường rất chăm chỉ, tỉ mỉ và cẩn trọng trong mọi việc. Họ có khả năng tổ chức tốt, luôn đề cao kỷ luật và nguyên tắc. Tuy nhiên, họ cũng dễ trở nên bảo thủ và đôi khi hơi cứng nhắc trong suy nghĩ.",

            "su_nghiep": {
                "nam": "Nam tuổi Dậu trong năm 2025 có nhiều cơ hội phát triển nếu biết mở lòng và linh hoạt hơn trong tư duy. Họ nên tập trung vào mục tiêu dài hạn và chú trọng mở rộng các mối quan hệ xã hội.",
                "nu": "Nữ tuổi Dậu sẽ có những bước tiến vững chắc trong công việc, đặc biệt là các lĩnh vực yêu cầu sự tỉ mỉ. Tuy nhiên, cần tự tin hơn để nắm bắt cơ hội thay vì chờ đợi quá lâu."
            },

            "tinh_duyen": {
                "nam": "Nam tuổi Dậu thường nghiêm túc trong tình cảm nhưng đôi khi thiếu sự lãng mạn. Họ cần mềm mỏng và lắng nghe nhiều hơn để tránh gây căng thẳng trong mối quan hệ.",
                "nu": "Nữ tuổi Dậu thủy chung, biết vun vén cho hạnh phúc nhưng dễ bị tổn thương bởi những lời nói vô tâm. Năm nay nên học cách chia sẻ nhiều hơn và đừng giữ cảm xúc trong lòng."
            },

            "cong_viec_su_nghiep": [
                "Năm 2025 hứa hẹn nhiều chuyển biến tích cực trong công việc.",
                "Có thể đạt được thành tựu nếu biết tận dụng cơ hội và mở rộng các mối quan hệ xã hội.",
                "Tránh mâu thuẫn nơi làm việc, nên giữ thái độ hòa nhã và chuyên nghiệp."
            ],

            "tai_loc": [
                "Tài chính ổn định nhưng cần cẩn trọng trong chi tiêu và đầu tư.",
                "Tránh cho vay mượn hoặc đầu tư vào các dự án không rõ ràng.",
                "Năm nay có thể phát sinh những khoản chi bất ngờ liên quan đến gia đình hoặc sức khỏe."
            ],

            "tinh_duyen_gia_dao": [
                "Người độc thân có thể gặp người phù hợp qua các mối quan hệ quen biết.",
                "Gia đạo hòa thuận nếu biết chia sẻ và lắng nghe.",
                "Cẩn thận trong lời nói để tránh hiểu lầm với người thân."
            ],

            "suc_khoe": {
                "nam": [
                "Nam tuổi Dậu cần duy trì thói quen sinh hoạt điều độ, tránh làm việc liên tục không nghỉ.",
                "Đề phòng các vấn đề về tiêu hóa và huyết áp khi căng thẳng kéo dài."
                ],
                "nu": [
                "Nữ tuổi Dậu cần chú ý đến giấc ngủ, có thể bị mất ngủ nếu lo nghĩ quá nhiều.",
                "Nên bổ sung dinh dưỡng phù hợp và tăng cường vận động nhẹ để giữ tinh thần tốt."
                ]
            },

            "dieu_can_chu_y": {
                "nam": [
                "Không nên bảo thủ quá mức khi làm việc nhóm.",
                "Chú ý đến việc cân bằng giữa công việc và nghỉ ngơi.",
                "Tận dụng các mối quan hệ tích cực để hỗ trợ công việc.",
                "Đừng ngại thay đổi nếu thấy cơ hội tốt hơn."
                ],
                "nu": [
                "Cẩn thận trong các vấn đề giấy tờ, hợp đồng.",
                "Hạn chế chi tiêu không cần thiết trong năm nay.",
                "Tập trung nâng cao chuyên môn để sẵn sàng cho những thay đổi sắp tới.",
                "Tránh so sánh bản thân với người khác – hãy tin vào con đường riêng của mình."
                ]
            }
            }
        ]
    },
    {
        "name": "Tuất",
        "id": "Dog",
        "data": [
            {
            "tieu_de": "Tử Vi Tuổi Tuất Năm 2025 (Năm Ất Tỵ)",

            "tinh_cach": "Người tuổi Tuất nổi bật với lòng trung thành, chân thành và tinh thần trách nhiệm cao. Họ luôn sẵn sàng giúp đỡ người khác, sống ngay thẳng và trọng nghĩa khí. Tuy nhiên, đôi khi lại quá nóng nảy hoặc cứng nhắc khi tranh luận.",

            "su_nghiep": {
                "nam": "Nam tuổi Tuất có cơ hội phát triển sự nghiệp ổn định trong năm 2025 nếu biết kiên nhẫn và giữ vững mục tiêu. Tuy nhiên, cần học cách lắng nghe và mềm mỏng hơn trong giao tiếp công việc.",
                "nu": "Nữ tuổi Tuất có xu hướng tiến chậm nhưng chắc trong sự nghiệp. Năm nay là thời điểm tốt để học thêm kỹ năng mới, mở rộng mạng lưới và tăng cường sự tự tin."
            },

            "tinh_duyen": {
                "nam": "Nam tuổi Tuất khi yêu thường chân thành và bảo vệ người mình thương, nhưng đôi khi thiếu sự linh hoạt. Hãy dành thời gian lắng nghe và thấu hiểu để duy trì sự gắn kết.",
                "nu": "Nữ tuổi Tuất nghiêm túc trong tình cảm, đôi khi hơi nhạy cảm. Năm 2025, nên mở lòng nhiều hơn để đón nhận những mối quan hệ tích cực và bền vững."
            },

            "cong_viec_su_nghiep": [
                "Năm 2025 là thời điểm tuổi Tuất cần kiên nhẫn và thận trọng trong các quyết định nghề nghiệp.",
                "Có cơ hội được quý nhân hỗ trợ, nhưng nên tránh tranh chấp nơi công sở.",
                "Đừng ngại học thêm kỹ năng mới để thích nghi với môi trường thay đổi."
            ],

            "tai_loc": [
                "Tài lộc khá ổn định, nhưng không nên đầu tư mạo hiểm.",
                "Các khoản thu có thể đến từ nghề phụ hoặc các mối quan hệ xã hội.",
                "Chi tiêu cần có kế hoạch rõ ràng để tránh thất thoát không đáng có."
            ],

            "tinh_duyen_gia_dao": [
                "Tình cảm gia đình hài hòa, người có gia đình nên dành thời gian cho người thân nhiều hơn.",
                "Người độc thân có thể gặp người phù hợp trong môi trường làm việc hoặc qua giới thiệu.",
                "Tránh để công việc ảnh hưởng quá nhiều đến mối quan hệ tình cảm."
            ],

            "suc_khoe": {
                "nam": [
                "Nam tuổi Tuất cần chú ý đến các bệnh liên quan đến tiêu hóa và huyết áp.",
                "Đừng làm việc quá sức, nên kết hợp nghỉ ngơi và vận động nhẹ để giữ thể lực ổn định."
                ],
                "nu": [
                "Nữ tuổi Tuất có thể bị mất ngủ hoặc căng thẳng do lo lắng quá nhiều.",
                "Nên duy trì chế độ ăn uống hợp lý và tập luyện nhẹ nhàng để cải thiện tinh thần."
                ]
            },

            "dieu_can_chu_y": {
                "nam": [
                "Cẩn trọng khi ký kết hợp đồng hoặc giao dịch tiền bạc.",
                "Đừng đặt niềm tin quá nhiều vào người chưa thực sự hiểu rõ.",
                "Tránh tranh cãi không cần thiết, đặc biệt nơi công sở.",
                "Tập trung vào phát triển kỹ năng mềm để hỗ trợ sự nghiệp.",
                "Chú ý đến sự cân bằng giữa lý trí và cảm xúc khi ra quyết định."
                ],
                "nu": [
                "Không nên ôm đồm quá nhiều việc, hãy học cách chia sẻ và phân bổ công việc.",
                "Tập trung vào sự ổn định thay vì thay đổi liên tục.",
                "Quan tâm nhiều hơn đến cảm xúc bản thân thay vì chỉ lo lắng cho người khác.",
                "Chủ động thiết lập ranh giới trong các mối quan hệ để tránh bị lợi dụng."
                ]
            }
            }
        ]
    },
    {
        "name": "Hợi",
        "id": "Pig",
        "data": [
            {
            "tieu_de": "Tử Vi Tuổi Hợi Năm 2025 (Năm Ất Tỵ)",

            "tinh_cach": "Người tuổi Hợi hiền lành, chân thành và nhân hậu. Họ thường sống tình cảm, khoan dung và không thích ganh đua. Tuy nhiên, đôi khi lại hơi dễ tin người và thiếu quyết đoán.",

            "su_nghiep": {
                "nam": "Nam tuổi Hợi được đánh giá cao bởi tinh thần trách nhiệm và sự kiên trì trong công việc. Tuy nhiên, năm 2025 đòi hỏi họ cần linh hoạt và chủ động hơn trước thay đổi.",
                "nu": "Nữ tuổi Hợi có nhiều tiềm năng phát triển sự nghiệp nếu biết tận dụng kỹ năng mềm và khả năng giao tiếp. Đây là thời điểm tốt để mở rộng mạng lưới và học hỏi thêm kiến thức mới."
            },

            "tinh_duyen": {
                "nam": "Nam tuổi Hợi thủy chung, tình cảm và luôn muốn vun đắp cho một mối quan hệ ổn định. Năm nay cần cởi mở hơn trong việc chia sẻ cảm xúc để tránh hiểu lầm.",
                "nu": "Nữ tuổi Hợi dịu dàng và dễ cảm thông, thường được đối phương trân trọng. Tuy nhiên, cần học cách bảo vệ cảm xúc cá nhân và tránh phụ thuộc quá mức vào tình cảm."
            },

            "cong_viec_su_nghiep": [
                "Năm 2025, tuổi Hợi sẽ đối mặt với nhiều thử thách trong công việc, đòi hỏi sự kiên nhẫn và linh hoạt.",
                "Cần tránh mâu thuẫn với đồng nghiệp, nên giữ thái độ ôn hòa và cầu thị.",
                "Đây là thời điểm tốt để học hỏi kỹ năng mới hoặc bắt đầu một dự án cá nhân."
            ],

            "tai_loc": [
                "Tài lộc ở mức trung bình, cần thận trọng trong việc chi tiêu.",
                "Không nên đầu tư lớn hoặc cho vay mượn tiền trong năm nay.",
                "Có thể có thu nhập thêm từ các công việc ngoài giờ hoặc nghề tay trái."
            ],

            "tinh_duyen_gia_dao": [
                "Chuyện tình cảm có tiến triển tốt nếu biết cách thấu hiểu và chia sẻ.",
                "Người đã kết hôn cần vun đắp tình cảm gia đình, tránh lạnh nhạt vì bận rộn công việc.",
                "Người độc thân nên mở rộng mối quan hệ xã hội để gặp được người phù hợp."
            ],

            "suc_khoe": {
                "nam": [
                "Cần chú ý đến các vấn đề tim mạch, đặc biệt khi làm việc căng thẳng kéo dài.",
                "Nên duy trì thói quen tập thể dục đều đặn, tránh rượu bia và thức khuya."
                ],
                "nu": [
                "Dễ bị mệt mỏi do làm việc quá sức hoặc lo nghĩ nhiều.",
                "Nên cân bằng công việc và nghỉ ngơi, đồng thời chăm sóc giấc ngủ và chế độ ăn uống."
                ]
            },

            "dieu_can_chu_y": {
                "nam": [
                "Không nên tin tưởng tuyệt đối vào người khác trong chuyện tiền bạc.",
                "Tránh quyết định vội vàng khi chưa đủ thông tin.",
                "Chủ động hành động thay vì chờ đợi cơ hội đến.",
                "Nên dành thời gian nghỉ ngơi để phục hồi năng lượng tinh thần."
                ],
                "nu": [
                "Học cách từ chối những việc không phù hợp để tránh bị lợi dụng.",
                "Không nên quá cảm tính trong quyết định tài chính và công việc.",
                "Chú ý đến việc xây dựng và bảo vệ các mối quan hệ tích cực.",
                "Dành thời gian chăm sóc bản thân và tránh để cảm xúc tiêu cực chi phối."
                ]
            }
            }
        ]
    }
]